# ExportFontInfo Class

---
A value used to represent the info stored in an ExportFontTable.
SystemObject Autodesk.Revit.DBExportFontInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportFontInfo : IDisposable

    Public Class ExportFontInfo
    	Implements IDisposable

    public ref class ExportFontInfo : IDisposable

    type ExportFontInfo =
        class
            interface IDisposable
        end
The ExportFontInfo type exposes the following members.
| Name| Description
---|---|---
| ExportFontInfo|  Constructs a new default ExportFontInfo.
| ExportFontInfo(ExportFontInfo)|  Constructs a new copy of the input ExportFontInfo object.
| ExportFontInfo(String)|  Constructs a new ExportFontInfo using the destination font name as input.
Top
| Name| Description
---|---|---
| DestinationFontName|  The destination font name (the name of the font in the exported format).
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportFontInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace